Revit 2026 API
EnergyDataSettings.OutsideAirPerPerson Property
 The rate of flow of outside air available per person.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public double OutsideAirPerPerson { get; set; }
Public Property OutsideAirPerPerson As Double
	Get
	Set
public:
property double OutsideAirPerPerson {
	double get ();
	void set (double value);
}
member OutsideAirPerPerson : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The outside airPerPerson does not fall within an appropriate range.
Remarks
 Stored in cubic feet per hour.
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace